#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warnings:

- Deprecated Resource
  on modules/vertex-ai-workbench/main.tf line 49

To see the full warning notes, run Terraform without -compact-warnings.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.google_client_config.provider: Reading...
module.gcr.google_project_service.api["artifactregistry.googleapis.com"]: Refreshing state... [id=tbd-2024l-3108962/artifactregistry.googleapis.com]
module.vpc.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/tbd-2024l-3108962/global/networks/main-vpc]
data.google_client_config.provider: Read complete after 0s [id=projects/"tbd-2024l-3108962"/regions/"europe-west1"/zones/<null>]
module.vpc.google_compute_firewall.fw-allow-ingress-from-iap: Refreshing state... [id=projects/tbd-2024l-3108962/global/firewalls/fw-allow-ingress-iap]
module.vpc.module.cloud-router.google_compute_router.router: Refreshing state... [id=projects/tbd-2024l-3108962/regions/europe-west1/routers/nat-router]
module.vpc.google_compute_firewall.default-internal-allow-all: Refreshing state... [id=projects/tbd-2024l-3108962/global/firewalls/default-internal-allow-all]
module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/subnet-01"]: Refreshing state... [id=projects/tbd-2024l-3108962/regions/europe-west1/subnetworks/subnet-01]
google_compute_firewall.allow-all-internal: Refreshing state... [id=projects/tbd-2024l-3108962/global/firewalls/allow-all-internal]
module.vpc.module.vpc.module.routes.google_compute_route.route["egress-internet"]: Refreshing state... [id=projects/tbd-2024l-3108962/global/routes/egress-internet]
module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"]: Refreshing state... [id=tbd-2024l-3108962/europe-west1/nat-router/nat-gateway]
module.dataproc.google_project_service.dataproc: Refreshing state... [id=tbd-2024l-3108962/dataproc.googleapis.com]
module.gcr.google_artifact_registry_repository.registry: Refreshing state... [id=projects/tbd-2024l-3108962/locations/europe/repositories/eu.gcr.io]
module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster: Refreshing state... [id=projects/tbd-2024l-3108962/regions/europe-west1/clusters/tbd-cluster]
module.jupyter_mlops_docker_image.docker_image.jupyter-mlops: Refreshing state... [id=sha256:dc3f989f7a85326c3e697ed77623b9412bb4d73e448cc89ba342e45f949eed68eu.gcr.io/tbd-2024l-3108962/jupyter-mlops:4.1.6]
module.jupyter_docker_image.docker_image.jupyter: Refreshing state... [id=sha256:482de7147e53a72981f2d84e0a6d6433b6b0ec93d7c35f0e926b4747995a5dadeu.gcr.io/tbd-2024l-3108962/jupyter:4.1.6]
module.jupyter_docker_image.docker_registry_image.jupyterlab: Refreshing state... [id=sha256:af0904f72f831cb6c104739929ac5b9ee2d34ff5614f8e588d7c98dd90f1880d]
module.jupyter_mlops_docker_image.docker_registry_image.jupyterlab: Refreshing state... [id=sha256:34b44de396cce11116143c9c78b588bc41a16c6312c595c2fa92cdb2af06da8b]
module.vertex_ai_workbench.google_project_service.notebooks: Refreshing state... [id=tbd-2024l-3108962/notebooks.googleapis.com]
module.vertex_ai_workbench.google_project_iam_binding.token_creator_role: Refreshing state... [id=tbd-2024l-3108962/roles/iam.serviceAccountTokenCreator]
module.vertex_ai_workbench.google_storage_bucket.notebook-conf-bucket: Refreshing state... [id=tbd-2024l-3108962-conf]
module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding: Refreshing state... [id=b/tbd-2024l-3108962-conf/roles/storage.objectViewer]
module.vertex_ai_workbench.google_storage_bucket_object.post-startup: Refreshing state... [id=tbd-2024l-3108962-conf-scripts/notebook_post_startup_script.sh]
module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook: Refreshing state... [id=projects/tbd-2024l-3108962/locations/europe-west1-b/instances/tbd-2024l-3108962-notebook]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.jupyter_docker_image.docker_image.jupyter has been deleted
  - resource "docker_image" "jupyter" {
        id       = "sha256:482de7147e53a72981f2d84e0a6d6433b6b0ec93d7c35f0e926b4747995a5dadeu.gcr.io/tbd-2024l-3108962/jupyter:4.1.6"
      - name     = "eu.gcr.io/tbd-2024l-3108962/jupyter:4.1.6" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.jupyter_mlops_docker_image.docker_image.jupyter-mlops has been deleted
  - resource "docker_image" "jupyter-mlops" {
        id       = "sha256:dc3f989f7a85326c3e697ed77623b9412bb4d73e448cc89ba342e45f949eed68eu.gcr.io/tbd-2024l-3108962/jupyter-mlops:4.1.6"
      - name     = "eu.gcr.io/tbd-2024l-3108962/jupyter-mlops:4.1.6" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.gcr.google_artifact_registry_repository.registry will be updated in-place
  ~ resource "google_artifact_registry_repository" "registry" {
        id                     = "projects/tbd-2024l-3108962/locations/europe/repositories/eu.gcr.io"
        name                   = "eu.gcr.io"
        # (12 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.jupyter_docker_image.docker_image.jupyter will be created
  + resource "docker_image" "jupyter" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2024l-3108962/jupyter:4.1.6"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "9ce1fe5afa895f2607bc62b5dcf78a071c008210"
        }

      + build {
          + build_args   = {
              + "DBT_SPARK_VERSION"     = "1.7.1"
              + "DBT_VERSION"           = "1.7.13"
              + "GCS_CONNECTOR_VERSION" = "2.2.17"
              + "JUPYTERLAB_VERSION"    = "4.1.6"
              + "PROJECT_NAME"          = "tbd-2024l-3108962"
              + "SPARK_VERSION"         = "3.3.2"
            }
          + cache_from   = []
          + context      = "modules/jupyter_docker_image/resources"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "eu.gcr.io/tbd-2024l-3108962/jupyter:latest",
            ]
        }
    }

  # module.jupyter_mlops_docker_image.docker_image.jupyter-mlops will be created
  + resource "docker_image" "jupyter-mlops" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2024l-3108962/jupyter-mlops:4.1.6"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "071e310a8b749a8859942cddb203482620c7d078"
        }

      + build {
          + build_args   = {
              + "DBT_SPARK_VERSION"     = "1.7.1"
              + "DBT_VERSION"           = "1.7.13"
              + "GCS_CONNECTOR_VERSION" = "2.2.17"
              + "JUPYTERLAB_VERSION"    = "4.1.6"
              + "KEDRO_VERSION"         = "0.19.5"
              + "MLFLOW_VERSION"        = "2.12.2"
              + "PROJECT_NAME"          = "tbd-2024l-3108962"
              + "SPARK_VERSION"         = "3.3.2"
              + "VS_CODE_VERSION"       = "4.23.1"
            }
          + cache_from   = []
          + context      = "modules/jupyter_mlops_docker_image/resources"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "eu.gcr.io/tbd-2024l-3108962/jupyter-mlops:latest",
            ]
        }
    }

  # module.vertex_ai_workbench.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "tbd-2024l-3108962"
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.vertex_ai_workbench.google_project_iam_binding.token_creator_role will be updated in-place
  ~ resource "google_project_iam_binding" "token_creator_role" {
        id      = "tbd-2024l-3108962/roles/iam.serviceAccountTokenCreator"
      ~ members = [
          - "serviceAccount:537477289707-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding will be updated in-place
  ~ resource "google_storage_bucket_iam_binding" "binding" {
        id      = "b/tbd-2024l-3108962-conf/roles/storage.objectViewer"
      ~ members = [
          - "serviceAccount:537477289707-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "iac_service_account" but a
value was found in file "env/project.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Deprecated Resource

  with module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook,
  on modules/vertex-ai-workbench/main.tf line 49, in resource "google_notebooks_instance" "tbd_notebook":
  49: resource "google_notebooks_instance" "tbd_notebook" {

`google_notebook_instance` is deprecated and will be removed in a future
major release. Use `google_workbench_instance` instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @abstruso, Action: `pull_request`, Working Directory: ``, Workflow: `Tech Tests`*